
Процедура ПередЗаписью(Отказ)
	
	ЭтотОбъект.Дата = ТекущаяДата();
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	ЗаписатьВРегистрСведений();
КонецПроцедуры

Процедура ЗаписатьВРегистрСведений()
	МенеджерЗаписи = РегистрыСведений.ФИОФизическихЛиц.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ФизическоеЛицо = ЭтотОбъект.Ссылка;
	МенеджерЗаписи.Фамилия = ЭтотОбъект.Фамилия;
	МенеджерЗаписи.Имя = ЭтотОбъект.Имя;
	МенеджерЗаписи.Отчество = ЭтотОбъект.Отчество;
	МенеджерЗаписи.Период = ЭтотОбъект.Дата;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры
