
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

//ищем физ. лицо по имени пользователя
ТекПользователь = Справочники.Пользователи.НайтиПоРеквизиту("Идентификатор",ИмяПользователя());
//если не нашли - создадим нового
Если ТекПользователь.Пустая() Тогда
НовПользователь = Справочники.Пользователи.СоздатьЭлемент();
НовПользователь.Идентификатор = ИмяПользователя();
//НовПользователь.Наименование = "Не авторизован";
НовПользователь.Записать();
ТекПользователь = НовПользователь.Ссылка;
КонецЕсли;
//присваиваем параметру сеанса ТекущийПользователь ссылку на справочник физ.лиц
ПараметрыСеанса.ТекущийПользователь = ТекПользователь;

КонецПроцедуры
