//Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

////ищем физ. лицо по имени пользователя
//ТекПользователь = Справочники.Пользователи.НайтиПоРеквизиту("Идентификатор",ИмяПользователя());
////если не нашли - создадим нового
//Если ТекПользователь.Пустая() Тогда
//НовПользователь = Справочники.Пользователи.СоздатьЭлемент();
//НовПользователь.Роль = ИмяПользователя();
//НовПользователь.Записать();
//ТекПользователь = НовПользователь.Ссылка;
//КонецЕсли;
////присваиваем параметру сеанса ТекущийПользователь ссылку на справочник физ.лиц
//ПараметрыСеанса.ТекущийПользователь = ТекПользователь;

//КонецПроцедуры
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	//ТекущийПользователь = ОбщийМодульСистема.ОпределитьТекущегоПользователя();
	//ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
	ТекП = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ТекП.Имя);
КонецПроцедуры
