Процедура ПолнотекстовыйПоиск() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|   Файлы.Ссылка КАК Ссылка,
		|	Файлы.ИмяФайла КАК ИмяФайла,
		|	Файлы.Содержание КАК Содержание,
		|	Файлы.Код КАК Код,
		|	Файлы.Изменён КАК Изменён
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Изменён = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Прав(ВыборкаДетальныеЗаписи.ИмяФайла,3) = "txt" Тогда
			ДвоичныеДанныеФайла =ВыборкаДетальныеЗаписи.Файл.Получить();
			ИмяВФ = ПолучитьИмяВременногоФайла("txt");
			ДвоичныеДанныеФайла.Записать(ИмяВФ);
			
			ФайлТекс = Новый ЧтениеТекста(ИмяВФ, КодировкаТекста.UTF8);
			
			ФайлОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ФайлОбъект.Содержание = ФайлТекс.Прочитать();
			ФайлОбъект.Изменён = Ложь;
			ФайлОбъект.Записать();
			ФайлТекс.Закрыть();	
			
			УдалитьФайлы(ИмяВФ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры