
&НаКлиенте
Процедура ДобавитьФайл(Команда)
	// Вставить содержимое обработчика.
	Оповещение  =  Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(Результат,Адрес,ВыбранноеИмяФайла,ДополнительныеПараметры) Экспорт
		
	Если Не Результат Тогда
 		Возврат; 
	КонецЕсли;
	ФайлНаФорме = Адрес;
	Объект.ПутьДоФайла = ВыбранноеИмяФайла;
	ФайлСИменем = Новый Файл(ВыбранноеИмяФайла);
	Объект.ИмяФайла = ФайлСИменем.Имя;

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(Предпросмотр) тогда
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Предпросмотр)); 	
		ТекущийОбъект.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Предпросмотр = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл"); 
КонецПроцедуры
