
&НаКлиенте
Процедура ДобавитьФайл(Команда)
	// Вставить содержимое обработчика.
	Оповещение  =  Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,,, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ОписаниеФайла, Параметр2) Экспорт
	Предпросмотр = ОписаниеФайла.Адрес;
	//ФайлСИменем = Новый Файл(ОписаниеФайла);
	//Объект.ИмяФайла = ФайлСИменем.Имя;
	Объект.ИмяФайла = ОписаниеФайла.СсылкаНаФайл.Имя;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(Предпросмотр) тогда
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Предпросмотр)); 	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Предпросмотр = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл"); 
КонецПроцедуры
