
&НаСервере
Процедура К_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НовыйЭлемент = Элементы.Добавить("К_Роль",Тип("ПолеФормы"), ЭтаФорма);
	НовыйЭлемент.Заголовок = "Роль";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.К_Роль";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора","РольНачалоВыбора"); 
КонецПроцедуры

&НаКлиенте
Процедура РольНачалоВыбора()	
	СтандартнаяОбработка = Ложь;
	Если Не ЭтаФорма.РолиЗагружены Тогда
		РольНачалоВыбораНаСервере(РолиЗагружены);
		ЭтаФорма.РолиЗагружены = Истина;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента",ЭтотОбъект);
	Элементы.К_Роль.СписокВыбора.ПоказатьВыборЭлемента(Оповещение);	
КонецПроцедуры

&НаСервере
Процедура РольНачалоВыбораНаСервере(Загружено)	
	КоллекцияРолей = Метаданные.Роли;
	МассивРолей = Новый Массив;
	Для Каждого Роль Из КоллекцияРолей Цикл
		МассивРолей.Добавить(Роль.Имя);	
	КонецЦикла; 		
	Элементы.К_Роль.СписокВыбора.ЗагрузитьЗначения(МассивРолей);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлемента(ВыбранныйЭлемент, СписокПараметров) Экспорт
	ПрошлаяРоль = Объект.К_Роль;
	Если ВыбранныйЭлемент = Неопределено Тогда
		Если ПрошлаяРоль = "" Тогда
			Сообщить("Не выбрано значение");
		Иначе 
			Объект.К_Роль = ПрошлаяРоль; 	
		КонецЕсли;
    Иначе
        Объект.К_Роль = ВыбранныйЭлемент.Значение;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РольОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Объект.К_Роль = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.РолиЗагружены = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура К_ВыбратьРольВместо(Команда)
	РольНачалоВыбора();
КонецПроцедуры


